성능테스트/메인페이지/load_result.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: load.js
     output: InfluxDBv1 (http://localhost:8086)

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m40s max duration (incl. graceful stop):
           * default: Up to 30 looping VUs for 2m10s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (2m10.5s), 00/30 VUs, 1481 complete and 0 interrupted iterations
default ✓ [======================================] 00/30 VUs  2m10s

     data_received..................: 2.0 MB 15 kB/s
     data_sent......................: 185 kB 1.4 kB/s
     http_req_blocked...............: avg=110.66µs min=3.78µs  med=6.67µs  max=33.51ms  p(90)=9.03µs  p(95)=16.32µs
     http_req_connecting............: avg=13.4µs   min=0s      med=0s      max=897.18µs p(90)=0s      p(95)=0s
   ✓ http_req_duration..............: avg=2.11ms   min=1.06ms  med=1.97ms  max=9.62ms   p(90)=2.78ms  p(95)=3.1ms
       { expected_response:true }...: avg=2.11ms   min=1.06ms  med=1.97ms  max=9.62ms   p(90)=2.78ms  p(95)=3.1ms
     http_req_failed................: 0.00%  ✓ 0         ✗ 1481
     http_req_receiving.............: avg=62.3µs   min=26.74µs med=63.13µs max=276.2µs  p(90)=75.57µs p(95)=78.83µs
     http_req_sending...............: avg=22.58µs  min=10.38µs med=20.3µs  max=230.73µs p(90)=33.06µs p(95)=43.45µs
     http_req_tls_handshaking.......: avg=76.7µs   min=0s      med=0s      max=15.53ms  p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=2.03ms   min=984.3µs med=1.88ms  max=9.53ms   p(90)=2.68ms  p(95)=3.01ms
     http_reqs......................: 1481   11.352388/s
     iteration_duration.............: avg=1s       min=1s      med=1s      max=1.03s    p(90)=1s      p(95)=1s
     iterations.....................: 1481   11.352388/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30